[
    {
    "id" : 1,
    "OurCountry" : true,
    "Category" : "Javascript",
    "BookName" : "Do it! 모던 자바스크립트 프로그래밍의 정석",
    "SubTitle" : "한권으로 끝내는 웹 개발 교과서",
    "Review" : [9.7, 1888],
    "Buyers" : [1, 46],
    "Author" : "고경희",
    "AuthorExplain" : "2010년 첫 책 출간 이후 웹 관련 강의와 집필을 꾸준히 해왔다. 웹 초창기부터 ASP와 자바 등을 소개하는 전문 도서를 번역하면서 웹 기술에 관심을 가지기 시작했고, 이후 HTML과 DHTML(Dynamic HTML), CSS, 자바스크립트 등 웹 관련 기술을 더 쉽게 익힐 수 있는 도서 60여 종을 집필했다. 특히 2021년 출간한 《Do it! HTML+CSS+자바스크립트 웹 표준의 정석》은 웹 개발에 입문하는 사람의 필독서로 자리매김하여 2년째 웹 분야 베스트셀러 1위를 이어오고 있다. 홍익대학교 컴퓨터공학과를 졸업하고 동 대학원에서 인공지능을 공부한 뒤, 현재 Development Technologies 분야에서 마이크로소프트 공인 최고 기술자(Microsoft Most Valuable Professional)로 활동하고 있다.",
    "BookSuggest" : ["한 권으로 끝내는 모던 자바스크립트 웹 개발 교과서!", "자바스크립트의 모든 것을 한 번에 공부할 수 있는 책이 나왔다! 출간한 후 웹 분야 도서 1위를 꾸준히 지키고 있는 《Do it! HTML+CSS+자바스크립트 웹 표준의 정석》의 고경희 저자는 ‘이제 자바스크립트는 웹, 서버, 앱까지 안 쓰는 곳이 없는 언어가 되었으니 제대로 알려 주고 싶다’는 생각으로 이 책을 집필했다. 자바스크립트를 모르는 입문자부터 지금도 자바스크립트로 코딩을 하고 있는 개발자까지 모두에게 도움이 될 수 있도록 최신 문법부터 다양한 API를 활용하는 방법까지 담아 자바스크립트의 교과서라 할 수 있는 책으로 완성했다. 모든 내용은 독자가 직접 해보며 배울 수 있도록 예제를 풀면서 알아본다.프런트엔드든 백엔드든 상관없이 모든 웹 분야의 뿌리는 자바스크립트다. 웹 분야에서 프로그래밍 실력을 제대로 키우고 싶은 모든 분에게 도움이 될 책이다."],
    "PublisherSuggest" : "“모던 자바스크립트의 모든 것을 한 권에!” 최신 문법부터 네이버ㆍ카카오 API를 활용한 실무까지 다 담았다. 자바스크립트는 이제 웹부터 서버, 앱에 이르기까지 쓰지 않는 곳이 없는 언어가 되었다. 웹 개발에 입문하면서 자바스크립트의 기초만 가볍게 공부했다면 실전에 뛰어들었을 때 너무나도 넓은 자바스크립트의 세계에 당황할 것이다. 이 책은 자바스크립트를 어디서부터 공부해야 할지 몰라 헤매는 독자를 위해 준비했다. 이 책 한 권만 제대로 읽으면 최신 문법부터 API 활용까지 지금 알아야 할 자바스크립트의 모든 것을 대부분 배울 수 있다. 자바스크립트가 처음이라면 이 책의 처음부터 끝까지 차근차근 공부해 보자. 기본 문법을 안다면 앞부분은 필요한 만큼만 살펴보고, ‘셋째마당. 자바스크립트와 객체’부터 집중해서 읽어 보자. 자바스크립트를 훨씬 깊이 이해할 수 있을 것이다. ECMAScript2015(ES6) 이후에 추가된 최신 문법도 배울 수 있다. 멀리 가려면 친구와 함께해 보자.",
    "Publisher" : "이지스 퍼블리싱",
    "PublicationDate" : "2022년 12월 05일",
    "BasicData" : [9791163034223, 704, 1],
    "EbookViewer" : {
        "SlideLength" : 12,
        "Slide" : [1,2,3,4,5,6,7,8,9,10,11,12]
    }
    },
    {
    "id" : 2,
    "OurCountry" : true,
    "Category" : "CSS",
    "BookName" : "Do it! 반응형 웹 페이지 만들기",
    "SubTitle" : "실무자가 꼭 알아야 할 반응형 웹 기술의 모든 것! ",
    "Review" : [8.4, 7],
    "Buyers" : [4, 67],
    "Author" : "김운아",
    "AuthorExplain" : "저자는 서비스 기획부터 웹 디자인, 개발까지 1인 3역을 해내는 멀티플레이형 디자이너 겸 풀스택 엔지니어다. 계원예술대학교에서 디자인을 전공하고 플래시 초창기 시절부터 웹의 변화 과정을 모두 경험했다. UI/UX, 프런트엔드, 백엔드까지 웹 전반에 걸쳐 두루 섭렵한 기술을 바탕으로 플렉서블 디지털 에이전시인 래디 클래식을 창업했다.",
    "BookSuggest" : ["개발자는 물론 기획자, 디자이너도 알아야 하는 반응형 웹의 필수 기술!", "실제 웹 페이지를 반응형 웹으로 변환하는 과정 대공개! 서비스 기획, 웹 디자인, 개발까지 1인 3역을 해내는 저자가 가장 효율적으로 반응형 웹사이트를 제작할 수 있는 방법과 노하우를 알려 준다. 헷갈리기 쉬운 반응형 웹의 기본 개념부터 플렉서블 박스, 가변 그리드, 미디어 쿼리, 뷰포트와 같은 핵심 기술까지 예제로 실습하는 전 과정을 담았다. 또한 실제 웹사이트의 구조를 잡고 콘텐츠를 배치하는 레이아웃 디자인과 HTML5, CSS3로 제작하는 과정도 자세히 들어 있다. 이 과정을 모두 완료하면 평범했던 기존 웹사이트도 다양한 화면 크기에 대응하는 반응형 웹사이트로 전환하고, 웹사이트의 유지 보수와 비용 감소, 검색 엔진 최적화까지 가능하다."],
    "PublisherSuggest" : "반응형 웹의 핵심 기술인 플렉서블 박스, 가변 그리드, 미디어 쿼리,뷰포트를 Do it! 실습으로 따라 하며 확실하게 익히자! 이 책은 반응형 웹에서 놓치지 말아야 할 플렉서블 박스, 가변 그리드, 미디어 쿼리, 뷰포트를 여러 번 실습하면서 확실하게 알려 준다. 특히 플렉서블 박스는 기존의 웹 기술로 해결하기 어려웠던 콘텐츠의 순서, 배치, 높이 등 레이아웃 설정 문제를 해결할 때 꼭 필요하다. 이 과정을 잘 따라 하고 익힌다면 실무에서 반응형 웹을 자유자재로 다룰 수 있을 것이다.",
    "Publisher" : "이지스 퍼블리싱",
    "PublicationDate" : "2021년 03월 25일",
    "BasicData" : [9791163032380, 344, 1],
    "EbookViewer" : {
        "SlideLength" : 16,
        "Slide" : [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16]
    }
    },
    {
    "id" : 3,
    "OurCountry" : true,
    "Category" : "HTML",
    "BookName" : "Do it! HTML+CSS+자바스크립트 웹 표준의 정석",
    "SubTitle" : "코딩 완초보도 OK! 기초부터 활용까지 완전정복",
    "Review" : [9.9, 84],
    "Buyers" : [1, 34],
    "Author" : "고경희",
    "AuthorExplain" : "2010년 첫 책 출간 이후 웹 관련 강의와 집필을 꾸준히 해왔다. 웹 초창기부터 ASP와 자바 등을 소개하는 전문 도서를 번역하면서 웹 기술에 관심을 가지기 시작했고, 이후 HTML과 DHTML(Dynamic HTML), CSS, 자바스크립트 등 웹 관련 기술을 더 쉽게 익힐 수 있는 도서 60여 종을 집필했다. 특히 2021년 출간한 《Do it! HTML+CSS+자바스크립트 웹 표준의 정석》은 웹 개발에 입문하는 사람의 필독서로 자리매김하여 2년째 웹 분야 베스트셀러 1위를 이어오고 있다. 홍익대학교 컴퓨터공학과를 졸업하고 동 대학원에서 인공지능을 공부한 뒤, 현재 Development Technologies 분야에서 마이크로소프트 공인 최고 기술자(Microsoft Most Valuable Professional)로 활동하고 있다.",
    "BookSuggest" : ["웹의 기본을 한 권으로 끝낼 수 있는 책이 탄생했다!", "8년 연속 웹 분야 도서 1위인 《Do it! HTML5+CSS3 웹 표준의 정석》의 고경희 저자는 ‘HTML, CSS, 자바스크립트를 한 권으로’ 배우고 싶다는 많은 독자의 요구를 모아 최신 경향을 반영한 이 책을 집필했다. 웹 개발을 시작하는 입문자도 쉽게 실습할 수 있고, 중요한 문법만 다시 공부하고 싶은 중ㆍ고급자에게도 도움이 된다. 친절한 설명은 기본! 핵심만 쏙쏙 뽑아서 실무에 바로 사용할 수 있는 예제도 풍성하게 담겨 있다. 또한 최신 웹 표준 기술인 HTML5, CSS3, 자바스크립트(ES6)를 기준으로 설명하며 책의 모든 내용을 압축한 최종 프로젝트 〈웹 사이트 만들기〉 PDF 전자책을 무료로 추가 제공한다. 수많은 독자가 입을 모아 ‘웹 분야의 교과서’라고 부르는 이유를 지금 확인해 보자!"],
    "PublisherSuggest" : "웹 개발 분야는 하루가 다르게 변하지만 웹 표준 기술인 HTML, CSS, 자바스크립트의 기본은 변하지 않는다. 이 책을 보고 나면 어떤 최신 웹 기술을 배우더라도 두렵지 않다. 웹 개발을 하든, 웹 디자인을 하든 이 책에서 소개하는 기술들이 기본이 되기 때문이다. 이 책은 웹에 입문한 독자를 위해 HTML의 태그가 무엇인지부터 시작해 CSS, 자바스크립트의 고급 기술까지 다양한 개념을 간단명료한 예제와 함께 충분히 설명한다. 총 500여 개가 넘는 〈Do it! 예제와 실습〉을 하고 〈한눈에 정리하기〉, 〈마무리 문제〉까지 풀고 나면 어느새 웹 기본기가 단단하게 쌓여 있을 것이다.",
    "Publisher" : "이지스 퍼블리싱",
    "PublicationDate" : "2021년 01월 22일",
    "BasicData" : [9791163032212, 648, 1],
    "EbookViewer" : {
        "SlideLength" : 14,
        "Slide" : [1,2,3,4,5,6,7,8,9,10,11,12,13,14]
    }
    },
    {
    "id" : 4,
    "OurCountry" : true,
    "Category" : "CSS",
    "BookName" : "디자이너에 의한 디자이너를 위한 실무코딩",
    "SubTitle" : "디자이너가 디자이너에게 알려주는 웹 프로그래밍 입문",
    "Review" : [9.3, 14],
    "Buyers" : [0, 50],
    "Author" : "엄태성",
    "AuthorExplain" : "선린인터넷고등학교, 아주대학교 미디어학부를 졸업하고 프리랜서 개발자 겸 디자이너로 활동하고 있다. 중고등학교 때부터 다양한 전국 웹 콘텐츠 공모전에서 다수 수상한 경력을 가지고 있으며, 최근에는 글로벌 어워드(Awwwards, CSSDesignAwards)에서 수상 및 비헨스, Muz 등에 소개되면서 포트폴리오를 인정받고 있다. 새로운 분야를 공부하고 도전하는 것을 좋아해서 UI/UX, 모션그래픽, 프론트 엔드 개발, 광고마케팅 등 다양한 분야에서 활동했으며, 현재는 웹 개발 프로젝트를 진행하면서 개발 관련 교육을 병행하고 있다.",
    "BookSuggest" : ["‘오직 디자이너를 위한 웹 프로그래밍 입문서’", "이 책은 기존 HTML+CSS 입문서에서 타깃을 디자이너에게 집중하여, 실무에서 자주 사용되지 않는 태그 및 CSS 속성들을 걷어내고 시각적으로 좀 더 디테일을 만들어주는 개발 속성을 보충한 웹 프로그래밍 입문서이다. 이제 디자이너는 종합적 관점의 사고를 요구하는 시대 속에서, 개발 지식을 통해 더 나은 디자인, 더 나은 디자이너로 성장해야 한다. 꼭 필요한 개발 지식을 배워 현장에서 인정받는 디자이너로서 우리의 능력과 몸값 모두 높여보자!"],
    "PublisherSuggest" : "디자이너들이 개발을 공부하려는 궁극적인 목적은 직접 개발을 하고자 하는 것보다 디자인하는 데에 있어서 도움을 받기 위함입니다. UI/UX 디자이너가 개발 지식을 갖추는 것은 분명 다른 디자이너와 차별화되는 강력한 무기이며, 실무에서도 다양한 이점이 있습니다. 하지만 디자이너가 개발 지식을 제대로 배우기 위해서는 디자인을 새롭게 배우는 것만큼이나 높은 학습량이 요구됩니다. 본서는 디자이너에게 꼭 필요한 부분만 알려주는 개발 자료의 부재에서 시작됐습니다. 웹 디자이너와 프론트엔드 개발자, 두 직업을 모두 섭렵한 저자가 디자이너에게 정말 필요한 개발 지식만을 담은 이 책은, 개발 공부에 이미 지쳤었던 디자이너, 그리고 정말 실무에 필요한 코딩만을 압축해서 알고 싶은 모든 디자이너에게 단비와 같은 책이 될 것입니다.",
    "Publisher" : "비제이퍼블릭",
    "PublicationDate" : "2021년 03월 29일",
    "BasicData" : [9791165920494, 368, 1],
    "EbookViewer" : {
        "SlideLength" : 20,
        "Slide" : [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]
    }
    },
    {
    "id" : 5,
    "OurCountry" : false,
    "Category" : "Javascript",
    "BookName" : "자바스크립트는 왜 그 모양일까?",
    "SubTitle" : "더글러스 크락포드가 알려주는 위험한 자바스크립트 안전하게 사용하는 법",
    "Review" : [10.0, 6],
    "Buyers" : [0, 83],
    "Author" : "더글러스 크락포드",
    "AuthorExplain" : "더글라스 크록포드(Douglas Crockford)는 자바스크립트 언어의 개발에 참여한 미국의 컴퓨터 프로그래머이자 기업가이다. JSON 데이터 포맷을 보급하였으며 JSLint, JSMin 등 다양한 자바스크립트 관련 도구들을 개발하였다. 현재 페이팔의 자바스크립트 선임 아키텍트로 있으며 자바스크립트, JSON, 그리고 관련 웹 기술의 작가, 연설가로 활동하고 있다.",
    "BookSuggest" : ["자바스크립트를 대하는 방법과 자바스크립트로 생각하는 방법을 알려준다!", "자바스크립트는 어떻게 동작하며, 어떻게 더 나은 언어가 될 수 있는지, 그리고 어떻게 더 잘 사용될 수 있는지를 다룬다. 이름, 숫자, 불(boolean) 타입, 문자열, 그리고 빈(bottom) 값과 같은 자바스크립트의 기본을 살펴보는 것으로 시작한다. 자바스크립트의 숫자형은 문제도 많고 한계도 많은 것처럼 보이지만, 저자는 이 문제를 어떻게 해결하면 되는지 보여 준다. 그러고 나서 자료구조와 함수 들을 살펴보고, 자바스크립트의 기저에서 동작하는 방식들을 알아본 다음, 고차원 함수를 사용해서 어떻게 하면 클래스 없이도 객체 지향 프로그래밍을 할 수 있는지 보여 준다. 또한 비동기 프로그래밍, 테스팅, 순수한 프로그래밍과 같이 다음 세대 언어에 꼭 필요할 만한 요소들을 다룬다. Neo라는 허수아비 언어를 만들어서 어떻게 완전한 트랜스파일러를 만들고 언어를 구현할 수 있는지도 보여 준다."],
    "PublisherSuggest" : "더글러스 크락포드는 자바스크립트 구루(Guru)라고 불리지만, 구루보다는 사실 성인(Mahatma)에 가깝다. 미네소타주 프로스트바이트 폭포(Frostbite Fall)에서 태어났는데, 너무 추워서 생후 6개월 만에 다른 곳으로 떠났다(사실 프로스트바이트 폭포는 만화에 나오는 가짜 지명이다). 그는 교육 시스템, 소규모 비즈니스 시스템, 사무 자동화, 게임, 인터랙티브 뮤직, 멀티미디어, 위치 기반 엔터테인먼트, 소셜 시스템, 프로그래밍 언어와 같이 다양한 분야에서 일해왔다. 일부러 보기 싫게 만든 것은 아니지만, 어쨌든 세상에서 가장 보기 싫은 프로그래밍 언어인 틸튼(Tilton)을 만들기도 했다. 그는 자바스크립트의 좋은 부분을 발견한 것으로 가장 널리 알려져 있다. 이 발견은 21세기의 가장 중요한 발견 중 하나다. 또한 세계에서 가장 많이 사랑받고 있는 데이터 교환 포맷인 JSON을 만들었다.",
    "Publisher" : "인사이트",
    "PublicationDate" : "2020년 05월 25일",
    "BasicData" : [9788966262595, 380, 1],
    "EbookViewer" : {
        "SlideLength" : 18,
        "Slide" : [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18]
    }
    }
]